/*
    Module 18:

    Note TODO: 
    =========================//=========================//=========================
    প্রাকটিস চ্যালেঞ্জ-1: 
    =========================//=========================//=========================
    প্রতিদিন তোমার কাজ কি? 
    ১) রাত ৮ টা বাজে মডিউল আনলক করো  
    ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো
    ৩) ভিডিও দেখতে দেখতে নোটস নাও 
    ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো 
    ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো 
    এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।  
*/
/* 
    var text1 = " ১) রাত ৮ টা বাজে মডিউল আনলক করো ";
    var text2 = " ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো";
    var text3 = " ৩) ভিডিও দেখতে দেখতে নোটস নাও";
    var text4 = " ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ";
    var text5 = " ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।";
    // ek line ei kora jeto jamela komanor jonno evabe koresi

    for (var j = 1; j <= 10; j++){
        console.log(j, text1,text2,text3,text4,text5)
    }
*/
/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-২: 
=========================//=========================//=========================
আবার একই জিনিস while লুপ চালিয়ে ১০ বার দেখানো।  */
/*
    var text1 = " ১) রাত ৮ টা বাজে মডিউল আনলক করো ";
    var text2 = " ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো";
    var text3 = " ৩) ভিডিও দেখতে দেখতে নোটস নাও";
    var text4 = " ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ";
    var text5 = " ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।";
    var i = 1;
    while (i <= 10) {
        console.log(text1,text2,text3,text4,text5)
        i++;
    }
*/
/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-৩: 
=========================//=========================//=========================
উপরের প্রব্লেমটাই while লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও  */
/*
    var text1 = " ১) রাত ৮ টা বাজে মডিউল আনলক করো ";
    var text2 = " ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো";
    var text3 = " ৩) ভিডিও দেখতে দেখতে নোটস নাও";
    var text4 = " ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ";
    var text5 = " ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।";
    var i = 10;
    while (1 <= i) {
        console.log(i, text1,text2,text3,text4,text5)
        i--;
    }
*/
/* =========================//=========================//=========================
প্রাকটিস চ্যালেঞ্জ-৪: 
=========================//=========================//=========================
উপরের প্রব্লেমটাই for লুপ রিভার্স ওয়েতে (decremental হিসেবে)করে দেখাও  */
/* 
    var text1 = " ১) রাত ৮ টা বাজে মডিউল আনলক করো ";
        var text2 = " ২) ফটাফট ভিডিও দেখে দেখে প্রাকটিস করো";
        var text3 = " ৩) ভিডিও দেখতে দেখতে নোটস নাও";
        var text4 = " ৪) মডিউল শেষ হলে পুরা মডিউল নিজে নিজে প্রাকটিস করো ";
        var text5 = " ৫) কোন কিছু বুঝতে না পারলে (চিন্তা করে দেখো এইখানে কিন্তু একটা শর্ত আছে ), সাপোর্ট সেশনে জয়েন করো এখন তোমার কাজ হচ্ছে একটা for লুপ ১০ বার চালিয়ে উপরের জিনিসগুলা আউটপুট হিসেবে দেখানো।";

    for (let i = 10; 1 <= i; i--) {
        console.log(i, text1,text2,text3,text4,text5)
    } 
*/